app/views/comments/_comments.html.erb

SELECT COUNT(*) FROM `comments` WHERE `comments`.`post_id` = 9
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 9 ORDER BY created_at DESC
---
<% if @post.comments.empty? %>