app/views/posts/_form.html.erb

SELECT `categories`.* FROM `categories` ORDER BY created_at DESC
---

  Category: <%= f.select :category_id, Category.all.collect{|c| [c.name, c.id]} %>