app/controllers/categories_controller.rb

def index

@categories = Category.all
---
SELECT `categories`.* FROM `categories` ORDER BY created_at DESC

def update

  if @category.update_attributes(params[:category])
---
UPDATE `categories` SET `name` = 'abcdefggggggggggg', `updated_at` = '2012-07-18 15:13:41' WHERE `categories`.`id` = 1

def create
@category=Category.new(params[:category])
if @category.save
---
INSERT INTO `categories` (`created_at`, `name`, `updated_at`) VALUES ('2012-07-18 15:21:13', NULL, '2012-07-18 15:21:13')

def destroy

@category.destroy
---
DELETE FROM `categories` WHERE `categories`.`id` = 3