app/controllers/comments_controller.rb

  def create
    @comment = @post.comments.build(params[:comment])
    if @comment.save
---
INSERT INTO `comments` (`comment`, `created_at`, `post_id`, `updated_at`) VALUES ('hello', '2012-07-18 04:53:50', 9, '2012-07-18 04:53:50')

  def destroy
  @post =Post.find(params[:post_id])
  @comment =Comment.find(params[:id])
   @comment.destroy
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 9 ORDER BY created_at DESC LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 4 ORDER BY created_at DESC LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 4