app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts` ORDER BY created_at DESC
---
  def index
    # this will fetch all the posts and assign the resultant array to the         instance var @posts
    # the instance variables assigned inside controllers are available directly in the views
    @posts = Post.all

UPDATE `posts` SET `title` = 'helloo', `body` = 'gd mrng', `updated_at` = '2012-07-17 04:43:58' WHERE `posts`.`id` = 3
---
  def update
    if @post.update_attributes(params[:post])

INSERT INTO `posts` (`body`, `category_id`, `created_at`, `title`, `updated_at`) VALUES ('batsman', 16, '2012-07-19 04:12:06', 'sports', '2012-07-19 04:12:06')
---
  def create
    @post = Post.new(params[:post])
    if @post.save # returns true or false

DELETE FROM `posts` WHERE `posts`.`id` = 6
---
  def destroy
    @post.destroy